import React from 'react';

const PersonalDataProcessing = () => {
    return (
        <container>
            <h4>Политика обработки персональных данных, предоставляемых субъектами на официальном сайте интернет - магазина ЗооЛАЙНЕР</h4>
            <h4>1. Общие положения</h4>
            <p className='mb-1'>1.1. Настоящая Политика (далее -Политика) принята ИП Косыгин Сергей Валерьевич (далее - ИП), являющимся администратором интернет-сайта https://zooliner.ru (далее -«Сайт») и осуществляющим обработку персональных данных, самостоятельно и добровольно размещенных на Сайте субъектами персональных данных (пользователями Сайта), с согласия таких субъектов.</p>
            <p className='mb-1'>1.2. Целью принятия настоящей Политики является соблюдение прав и законных интересов граждан и положений действующего законодательства Российской Федерации при обработке персональных данных.</p>
            <p className='mb-1'>1.3. Политика принята в соответствии с требованиями Федерального закона от 27.07.2006 г.No 152-ФЗ «О персональных данных».</p>
            <p className='mb-1'>1.4. Действие настоящего документа распространяется на все случаи обработки персональных данных пользователей Сайта, как с применением средств автоматизации, так и без применения таковых.</p>
            <p className='mb-1'>1.5. Используемые в настоящем документе понятия («персональные данные», «обработка персональных данных» и т.п.) толкуются согласно их определению в Федеральном законе «О персональных данных».</p>
            <h4 className='mb-1'>2. Термины и определения</h4>
            <p>
                <ul>
                    <li>Автоматизированная обработка персональных данных -обработка персональных данных с помощью средств вычислительной техники;</li>
                    <li>Блокирование персональных данных - временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных);</li>
                    <li>Информационная система персональных данных -совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств;</li>
                    <li>ИП Косыгин Сергей Валерьевич, ОГРН 317246800107966, ИНН 245803520818 , зарегистрирован по адресу: 353411 Краснодарский край, городской округ Анапа, с. Супсех. ул. Космонавта Комарова 46А. Обработка персональных данных -любое действие (операция) или совокупность действий (операций) с персональными данными, совершаемых с использованием средств автоматизации или без их использования.</li>
                    <li>Обработка персональных данных включает в себя, в том числе: сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение.</li>
                    <li>Обезличивание персональных данных - действия, в результате которых становится невозможным без использования дополнительной информации определить принадлежность персональных данных конкретному субъекту персональных данных;</li>
                    <li>Персональные данные - любая информация, относящаяся прямо или косвенно к определенному или определяемому физическому лицу (субъекту персональных данных), в том числе ФИО, адрес электронной почты, номер телефона, адрес;</li>
                    <li>Предоставление персональных данных -действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц;</li>
                    <li>Распространение персональных данных -действия, направленные на раскрытие персональных данных неопределенному кругу лиц;</li>
                    <li>Субъект персональных данных –пользователи(их представители)сайта https://zooliner.ru</li>
                    <li>Уничтожение персональных данных - действия, в результате которых становится невозможным восстановить содержание персональных данных в информационной системе персональных данных и (или) в результате которых уничтожаются материальные носители персональных данных;</li>
                </ul>
            </p>
            <h4>3. Цели обработки персональных данных</h4>
            <p>3.1. Обработка персональных данных пользователей Сайта осуществляется ИП в следующих целях:
                <ul>
                    <li>осуществление деятельности по администрированию Сайта и обеспечению его функциональности, в том числе обеспечение возможности информирования пользователей Сайта об услугах и новостях ИП, обеспечение возможности пользователям Сайта обратиться в ИП за получением интересующей их информации и т.п.</li>
                    <li>ведение статистического учета;</li>
                    <li>заключение договоров с пользователями Сайта, касающихся использования Сайта, в том числе договоров по продаже товаров, оказание пользователям дополнительных услуг и т.п.;</li>
                    <li>направление пользователям Сайта сообщений, касающихся вопросов функционирования и использования сервисов Сайта;</li>
                    <li>в иных целях, не противоречащих действующему законодательству Российской Федерации и условиям соглашений между ИП и соответствующими пользователями Сайта.</li>
                </ul>
            </p>
            <h4>4. Принципы обработки персональных данных</h4>
            <p>
                4.1. Обработка персональных данных, предоставленных их субъектами посредством Сайта, осуществляется с соблюдением следующих основных принципов:
                <ul>
                    <li>обработка персональных данных осуществляется на законной и справедливой основе;</li>
                    <li>обработка персональных данных ограничивается достижением конкретных, заранее определенных и законных целей;</li>
                    <li>не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой;</li>
                    <li>обработке подлежат только персональные данные, которые отвечают целям их обработки;</li>
                    <li>иных принципов, предусмотренных действующим законодательством Российской Федерации о персональных данных.</li>
                </ul>

            </p>
            <h4>5. Условия обработки персональных данных</h4>
            <p>
                <p className='mb-1'>5.1. Обработка персональных данных в Обществе осуществляется с соблюдением принципов и условий, предусмотренных действующим законодательством Российской Федерации о персональных данных.</p>
                <p className='mb-1'>5.2. Сотрудники, получившие доступ к персональным данным пользователей Сайта, имеют обязательства не раскрывать их третьим лицам и не распространять иным образом без получения на то согласия соответствующих субъектов персональных данных, если иное прямо не предусмотрено действующим законодательством Российской Федерации.</p>
                <p className='mb-1'>5.3. ИП вправе поручить обработку персональных данных пользователей Сайта другому лицу с их согласия, если иное не предусмотрено действующим законодательством Российской Федерации.</p>
                <p className='mb-1'>5.4. Обработка персональных данных пользователей Сайта осуществляется ИП в течение всего срока без ограничений с момента предоставления субъектом персональных данных соответствующего согласия на их обработку и до момента отзыва такого согласия в установленном законодательством Российской Федерации порядке.</p>
            </p>
            <h4>6. Права субъектов персональных данных</h4>
            <p>
                <p className='mb-1'>6.1. Пользователи Сайта принимают решение о предоставлении своих персональных данных и дают ИП согласие на их обработку свободно, своей волей и в своем интересе. Использование Сайта подтверждает безоговорочное согласие пользователя с настоящей Политикой и указанными в ней условиями обработки его персональной информации, в случае несогласия с этими условиям и пользователь должен воздержаться от использования.</p>
                <p className='mb-1'>6.2. Согласие на обработку персональных данных предоставляется их субъектом в электронной форме перед заполнением и отправкой регистрационной формы при регистрации и создании личного кабинета на Сайте, при подтверждении заказа, если иное не предусмотрено действующим законодательством Российской Федерации.</p>
            </p>
        </container>
    );
};

export default PersonalDataProcessing;